[
    "If you've got a dollar, there's plenty to share.",
    "Never a failure, always a lesson.",
    "The minute you learn to love yourself you won't want to be anyone else.",
    "It's important for me to know who I am. There's no way for people to know me.",
    "Hurt me with the truth. Don't comfort me with a lie.",
    "I think a lot of people are afraid of being happy because of what others might think.",
    "People are gonna talk whether you doing good or bad.",
    "Let go of the things that make you feel dead! Life is worth living!",
    "Don't hide from who you are.",
    "I don't do things for the response or the controversy. I just live my life.",
    "When you realize who you live for, and who's important to please, a lot of people will actually start living. I am never going to get caught up in that. I'm gonna look back on my life and say that I enjoyed it – and I lived it for me.",
    "I stand up for what I believe in, and a lot of the time that can be against people's opinions.",
    "You have to just accept your body. You may not love it all the way, but you just have to be comfortable with it, comfortable with knowing that that's your body.",
    "I love reading people. I really enjoy watching, observing, and being able to figure out a person, the reason they wore that dress, the reason they smell the way they do.",
    "Nobody can understand what you're feeling unless they burn the way you burned.",
    "Ask God for forgiveness, and leave your regrets in the past.",
    "If I cry, it's because I'm very angry and I can't do anything about it because I've run into a dead end. That's when the tears would come down.",
    "I hate going to the gym and doing it the old-fashioned way. I hate anything that's too straightforward, too routine, too familiar, and I get bored really, really quickly.",
    "Be a girl with a mind, a b**ch with an attitude, a lady with class.",
    "Sure, you wish you did some things differently. But there is no sense in becoming burdened with regret over things you have no power to change.",
    "I am a child but I have to think and act like a woman, this business forces you to.",
    "If you don't live your life, who the f**k will?",
    "When I was fourteen and first started going out, I always wanted to be the opposite of everyone else. So I would go to the club in a polo T-shirt and pants and sneakers and a hat on backward, just so I would not be dressed like other girls.",
    "Even as a child I remember thinking: she can beat me, but she can't beat my outfit.",
    "Success for me isn't a destination it's a journey. Everybody's working to get to the top but where is the top? It's all about working harder and getting better and moving up and up.",
    "It's tougher to be vulnerable than to actually be tough.",
    "When something feels real, you don't make any apologies for it. When it feels good to you, nothing else matters. Everything else is just noise.",
    "People think, because we're young, we aren't complex, but that's not true. We deal with life and love and broken hearts in the same way a woman a few years older might.",
    "Young people, we have this thing about us, this invincibility, because we're young and we're growing up and we want to have fun, and we want to be crazy, and nothing's wrong with that unless you're not being responsible.",
    "As a young female I think it's important that young people know there's nothing wrong with having fun, nobody is telling us to be square or be boring, but we have to be safe.",
    "Don't lower your standards for anything or anyone.",
    "There's not any religion or any culture or any race or any generation that cannot get AIDS or HIV. We all have to take responsibility for ourselves and get tested to know our status, and spread the word.",
    "If I cry, it's because I'm very angry and I can't do anything about it because I've run into a dead end. That's when the tears would come down.",
    "If someone is right for you, you'll know it.",
    "You don't want to live your life and then meet someone. You want to share your life with someone. That's what I'm missing right now.",
    "I think honesty is the ultimate liberation in life. People want to shy away from the truth and keep sweeping it under the rug. But after a while, you pick up the rug and there's just way too much dirt, so you might as well just be up front about it.",
    "It's hard to imagine, but we can't think of HIV/AIDS as being somebody else's story. It could be any of ours.",
    "If you want to do something for Jah, then dont associate with people who do nothing.",
    "I feel like pop stars can't be rock stars anymore because they have to be role models, and it takes the fun out of it for us, because we just want to have fun with art.",
    "All you need to do is help one person, expecting nothing in return. To me, that is a humanitarian.",
    "You may never be good enough for everybody, but you will always be the best for somebody.",
    "It’s nice to look back on your life and see things as lessons, and not regrets.",
    "I used to feel unsafe right in the moment of an accomplishment - I felt the ground fall from under my feet because this could be the end. And even now, while everyone is celebrating, I'm on to the next thing. I don't want to get lost in this big cushion of success.",
    "I always believed that when you follow your heart or your gut, when you really follow the things that feel great to you, you can never lose, because settling is the worst feeling in the world.",
    "Women feel empowered when they can do the things that are supposed to be only for men, you know? It breaks boundaries, it's liberating, and it's empowering when you feel like, 'Well, I can do that, too.",
    "That's all I could ever hope for, to have a positive effect on women. Because women are powerful, powerful beings. But they're also the most doubtful beings. They'll never know - we'll never know - how powerful we are.",
    "My tits bother you?"
]