[
    "My grandmother always used to say if you've got a dollar, there's plenty to share.",
    "If there's anything that I’ve learned, it’s that we can only fix this world together. We can't do it divided.",
    "We can't let the desensitivity seep in. The 'If it's your problem, then it's not mine'. It's a woman's problem. It's a black people problem. It's a poor people problem.",
    "Never a failure, always a lesson.",
    "Tell your friends to pull up!",
    "The minute you learn to love yourself you won't want to be anyone else.",
    "It's important for me to know who I am. There's no way for people to know me.",
    "I think a lot of people are afraid of being happy because of what others might think.",
    "We're all human. And we all just want a chance: a chance at life, a chance in education, a chance at a future, really.",
    "People are gonna talk whether you doing good or bad.",
    "Let go of the things that make you feel dead! Life is worth living!",
    "Don't hide from who you are.",
    "I don't do things for the response or the controversy. I just live my life.",
    "When you realize who you live for, and who's important to please, a lot of people will actually start living.",
    "I stand up for what I believe in, and a lot of the time that can be against people's opinions.",
    "You have to just accept your body. You may not love it all the way, but you just have to be comfortable with it, comfortable with knowing that that's your body.",
    "I love reading people. I really enjoy watching, observing, and being able to figure out a person, the reason they wore that dress, the reason they smell the way they do.",
    "No one can understand what you're feeling unless you burn them the way they burned you.",
    "Ask God for forgiveness, and leave your regrets in the past.",
    "Be a girl with a mind, a bitch with an attitude, a lady with class.",
    "Sure, you wish you did some things differently. But there is no sense in becoming burdened with regret over things you have no power to change.",
    "If you don't live your life, who the fuck will?",
    "She can beat me, but she can't beat my outfit.",
    "Success for me isn't a destination it's a journey. Everybody's working to get to the top but where is the top? It's all about working harder and getting better and moving up and up.",
    "It's tougher to be vulnerable than to actually be tough.",
    "When something feels real, you don't make any apologies for it. When it feels good to you, nothing else matters. Everything else is just noise.",
    "People think, because we're young, we aren't complex, but that's not true. We deal with life and love and broken hearts in the same way a woman a few years older might.",
    "Young people, we have this thing about us, this invincibility, because we're young and we're growing up and we want to have fun, and we want to be crazy, and nothing's wrong with that unless you're not being responsible.",
    "As a young female I think it's important that young people know there's nothing wrong with having fun, nobody is telling us to be square or be boring, but we have to be safe.",
    "Don't lower your standards for anything or anyone.",
    "There's not any religion or any culture or any race or any generation that cannot get AIDS or HIV. We all have to take responsibility for ourselves and get tested to know our status, and spread the word.",
    "If someone is right for you, you'll know it.",
    "You don't want to live your life and then meet someone. You want to share your life with someone. That's what I'm missing right now.",
    "I think honesty is the ultimate liberation in life. People want to shy away from the truth and keep sweeping it under the rug. But after a while, you pick up the rug and there's just way too much dirt, so you might as well just be up front about it.",
    "It's hard to imagine, but we can't think of HIV/AIDS as being somebody else's story. It could be any of ours.",
    "If you want to do something for Jah, then dont associate with people who do nothing.",
    "I feel like pop stars can't be rock stars anymore because they have to be role models, and it takes the fun out of it for us, because we just want to have fun with art.",
    "All you need to do is help one person, expecting nothing in return. To me, that is a humanitarian.",
    "You may never be good enough for everybody, but you will always be the best for somebody.",
    "It’s nice to look back on your life and see things as lessons, and not regrets.",
    "I always believed that when you follow your heart or your gut, when you really follow the things that feel great to you, you can never lose, because settling is the worst feeling in the world.",
    "Women feel empowered when they can do the things that are supposed to be only for men, you know? It breaks boundaries, it's liberating, and it's empowering when you feel like, 'Well, I can do that, too'.",
    "That's all I could ever hope for, to have a positive effect on women. Because women are powerful, powerful beings. But they're also the most doubtful beings. They'll never know - we'll never know - how powerful we are.",
    "My tits bother you?",
    "Even mentally, just to be away from my phone, to be in the moment, that has been key for my growth.",
    "OK, so now that I'm 30, are there things I'm supposed to do? Should I be worried? Should I be freezing my eggs? What do you do at 30?!",
    "You’ve just got to laugh at yourself, honestly. I mean, I know when I’m having a fat day and when I’ve lost weight. I accept all of the bodies.",
    "I'm not built like a Victoria's Secret girl, and I still feel very beautiful and confident in my lingerie.",
    "As women, we're looked at as the needy ones, the naggy ones, the ones who are going to be heartbroken in a relationship.",
    "Guys don't like getting the cards flipped on them — ever!",
    "Now each time I hug somebody lately, I hug them like it's the last time. That may be my biggest life lesson, not to wait on anything, not even tomorrow. Tomorrow is too late in my opinion.",
    "I don't feel outside the fray. When I see something happen to any woman, a woman of any minority, kids, black men being murdered in the streets — I can't remove myself from that.",
    "The Guyanese are like the Mexicans of Barbados. That's why I really relate and empathise with Mexican people or Latino people, who are discriminated against in America. I know what it feels like to have the immigration come into your home in the middle of the night and drag people out.",
    "What's more personal than politics?",
    "I'm realising life is really short. You don't have a lot of time to tolerate shit, you know? When you're overwhelmed, you need to start cutting things out. What's happening now is that I'm going back to black and white. My grey area is shutting down.",
    "They diminish you as a mother if there’s not a Dad in your kids' lives. But the only thing that matters is happiness… the only thing that can raise a child, truly, is love.",
    "I rarely know exactly what I want to do, but always know exactly how I want it to make me feel. Feeling always leads the sound!",
    "In my heart, I knew singing was gonna be in my future, but I considered psychology, hairdressing, banking, teaching, acting, modeling, aviation, and philanthropy. I just didn't know I'd pretty much be doing all of these things eventually!",
    "My lifelong obsession with makeup started with watching my mom put her makeup on. I always loved to watch her, and all the funny faces she was making in the mirror.",
    "Makeup is like a secret weapon. Depending on my mood, my look, or the occasion, makeup can go from very subtle to a complete transformation, and that's the fun in makeup: being able to play and create in endless ways.",
    "You need to make time for yourself, because your mental health depends on it. If you're not happy, you're not going to be happy even doing things that you love doing. It'd feel like a chore. I never want work to feel like a chore.",
    "There's that idea of being a child behind a screen and having that feeling like you can say anything. That child is who I imagine behind a comment every time I see one. They would never say that to my face.",
    "I always want to start my day with a little devotion. I buy these devotion books and they're dated, so you just pull up the date and that devotion is for that day.",
    "I honestly think how much fun it would be to live my reputation.",
    "I always see the best in people. I hope for the best, and I always look for that little bit of good, that potential, and I wait for it to blossom.",
    "Men are afraid to be men. They think being a real man is actually being a pussy. They won't be a gentleman because that makes them appear soft.",
    "I get fearful of relationships because I feel guilty about wanting someone to be completely faithful and loyal, when I can't even give them 10 percent of the attention that they need.",
    "For me, and anyone who's been a victim of domestic abuse, nobody wants to even remember it. Nobody even wants to admit it.",
    "There's a long way to fall when you pretend that you're so far away from the earth, far away from reality, floating in a bubble that’s protected by fame or success.",
    "It can be poison to you, fame.",
    "Even tragedy, every trial in your life, is a test. It's like a class — you take an exam, and if you pass, you move on to the next. You still have to take another test and prove yourself again.",
    "Settling makes you feel like a sellout. It makes you feel like a liar.",
    "I have always freed the nipple. It was never to get attention. Never sexual. Never in desperation.",
    "I just have a way of breaking the rules even when I don't intend to",
    "I take risks because I get bored. And I get bored very easily.",
    "A song is like a tattoo – you can never get away from it.",
    "When I see myself as an old woman, I just think about being happy. And hopefully, I'll still be fly.",
    "My thoughts never bore me. I like to spend my time alone wisely. A moment of quiet. A moment of silence. A moment of just organising my thoughts. I just enjoy being alone. Maybe a little too much...",
    "I do not swim with sharks... sharks swim with sharks.",
    "I think I'm like most people — we fear the unknown and the things that have yet to come to pass, which are the very things that don't deserve to be feared.",
    "When you give God complete control, it's very hard not to be fearless.",
    "I'm not generally a sensitive person, but I tend to be more sensitive toward others and what they're going through.",
    "I have friends from rock stars to rastas; I don't even know what an unexpected friend is at this point.",
    "You can't lower your standards for a guy because he won't respect you and he'll tell his friends. You always have to stick up for yourself and speak your mind.",
    "Some people never figure themselves out, and that's sad. I'm still learning who I am, but I'm not scared to be myself anymore.",
    "I felt like I went to sleep as Rihanna and woke up as Britney Spears.",
    "Domestic violence is a big secret. No kid goes around and lets people know their parents fight. Teenage girls can't tell their parents that their boyfriend beat them up. You don't dare let your neighbor know that you fight. It's one of the things we will hide, because it's embarrassing.",
    "Fashion for me is another way I get to express myself creatively. It is one of the fun things I get to do: to play dress-up, and create outfits and looks that aren't typical. I am an artist, so I like creating things.",
    "I hate drama. But at the same time, nothing bothers me more than when life's perfect. And that's the sick part. I just love a challenge, whether it's a relationship, my career, clothing.",
    "I get kind of numb to hearing 'Rihanna, Rihanna, Rihanna'. When I hear Robyn, I pay attention.",
    "I do think I'm a bit of a masochist. It's not something I'm proud of. I think it's common for people who witness abuse in their household. They can never smell how beautiful a rose is unless they get pricked by a thorn.",
    "When somebody else lies to you, you don't trust them. Trying lying to yourself, that's even worse. You can't paint a fake picture for too long before the truth comes out and then it's hard that it doesn't match up.",
    "If you learn from mistakes it's not failure. If you go and do the exact same fucking thing then that's the stupidest thing ever.",
    "I could never identify with that word, weak.",
    "Guys need attention. They need that nourishment, that little stroke of the ego that gets them by every now and then.",
    "All girls rock. Black girls, we just on another level.",
    "I'm a black woman. I come from a black woman who came from a black woman, who came from a black woman and I'm going to give birth to a black woman.",
    "Rihanna, that tends to be people's own [creation]. Robyn is who I am. Rihanna — that's an idea of who I am."
]